In [1]:
import pandas as pd

In [2]:
csv_path = "^GSPC.csv"
sp500_df = pd.read_csv(csv_path)

In [6]:
sp500_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-01,2058.899902,2072.360107,1988.119995,1994.989990,1994.989990,77330040000
1,2015-02-01,1996.670044,2119.590088,1980.900024,2104.500000,2104.500000,68775560000
2,2015-03-01,2105.229980,2117.520020,2039.689941,2067.889893,2067.889893,76675850000
3,2015-04-01,2067.629883,2125.919922,2048.379883,2085.510010,2085.510010,72060940000
4,2015-05-01,2087.379883,2134.719971,2067.929932,2107.389893,2107.389893,65187730000

In [7]:
# Rename Adj Close column to Ticker Symbol for the Stock.
sp500_df = sp500_df.rename(columns = {'Adj Close': 'S&P500'})
sp500_df.head()

,Date,Open,High,Low,Close,S&P500,Volume
0,2015-01-01,2058.899902,2072.360107,1988.119995,1994.989990,1994.989990,77330040000
1,2015-02-01,1996.670044,2119.590088,1980.900024,2104.500000,2104.500000,68775560000
2,2015-03-01,2105.229980,2117.520020,2039.689941,2067.889893,2067.889893,76675850000
3,2015-04-01,2067.629883,2125.919922,2048.379883,2085.510010,2085.510010,72060940000
4,2015-05-01,2087.379883,2134.719971,2067.929932,2107.389893,2107.389893,65187730000

In [10]:
# Drop all columns except Date & Renamed Ticker Symbol column
sp500_clean = sp500_df[['Date','S&P500']]
sp500_clean.head()

         Date       S&P500
0  2015-01-01  1994.989990
1  2015-02-01  2104.500000
2  2015-03-01  2067.889893
3  2015-04-01  2085.510010
4  2015-05-01  2107.389893

In [16]:
# Make sure length is 60
len(sp500_clean)

60

In [15]:
# Check for Null Values
len(sp500_clean.dropna())

60